# PANDAS - Panel Data

Pandas is an important python library for data manipulation, wrangling and analysis

Data structures of Panda:

series : 1D

Data frame : 2D

What Can Pandas Do? Pandas gives you answers about the data. Like:

Is there a correlation between two or more columns?

What is average value?

Max value?

Min value?

Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values. This is called cleaning the data.

In [13]:
import pandas as pd

Syntax to create series :

pd.Series(data, index)

In [14]:
s = ([2,3,4,5,6])
type(s)

list

In [15]:
s1=(10, )
type(s1)

tuple

In [16]:
s = pd.Series([2,3,4,1,5,32.5])
print(s)
print(type(s))

0     2.0
1     3.0
2     4.0
3     1.0
4     5.0
5    32.5
dtype: float64
<class 'pandas.core.series.Series'>

In [17]:
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)
print(type(s))

0    a
1    b
2    c
3    d
dtype: object
<class 'pandas.core.series.Series'>

In [18]:
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data,index = [100,101,102,103])
print(s)
print(type(s))

100    a
101    b
102    c
103    d
dtype: object
<class 'pandas.core.series.Series'>

In [19]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [20]:
population = pd.Series(population_dict)
print(population)
print(type(population))

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64
<class 'pandas.core.series.Series'>

In [21]:
population['California'] # retreving data using label indexing # explicit index - index given by user

38956785

In [22]:
population[0] # retreving data using default indexing # implicit index - index generated by python

38956785

In [23]:
population['California':'Illinois']  # slicing

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [24]:
population[0:5]

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [25]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}
population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [26]:
population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [27]:
df1 = pd.Series(population_dict)
df1

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [28]:
df1.shape

(5,)

In [29]:
df = pd.DataFrame(df1)
df

                   0
California  38956785
Texas       26441568
New York    19555647
Florida     12364569
Illinois    12882135

In [30]:
df.shape

(5, 1)

# Data Frame

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

syntax 

pd.DataFrame(data, index, columns)

pd.Series(data,index)

In [31]:
# creating data frame from a single list

import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [32]:
# creating data frame from a multiple list

data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [33]:
# Create a Dataframe from Dict of ndarrays

data = {'Name':['Tom','Jack','Steve','Mike'],'Age':[28,34,24,12]}
df = pd.DataFrame(data)
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   24
3   Mike   12

In [34]:
# Create a Dataframe from Dict of ndarrays

data = {'Name':['Tom','Jack','Steve','Mike'],'Age':[28,34,24,12]}
df = pd.DataFrame(data, index = ['rank1','rank2','rank3','rank4'])
print(df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   24
rank4   Mike   12

In [35]:
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   24
rank4   Mike   12

In [37]:
df = pd.DataFrame(df1,columns = ['Population'])
df

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [5]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}
population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [38]:
df1 = pd.Series(population_dict)
df1

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [39]:
df = pd.DataFrame(df1,columns = ['Population'])
df

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [40]:
df2 = df.reset_index()
df2

# Reset the index of the DataFrame, and use the default one instead

# when we reset index the old index is added as a column ad new sequential index is used

        index  Population
0  California    38956785
1       Texas    26441568
2    New York    19555647
3     Florida    12364569
4    Illinois    12882135

In [41]:
df2.columns

Index(['index', 'Population'], dtype='object')

In [42]:
df2.columns= ['city', 'Population']

In [43]:
df2

         city  Population
0  California    38956785
1       Texas    26441568
2    New York    19555647
3     Florida    12364569
4    Illinois    12882135

In [44]:
df2.shape

(5, 2)

In [54]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [57]:
import numpy as np
pd.DataFrame(np.random.rand(3,2), columns = ['A','B'],index = ['a','b','c'])

          A         B
a  0.407941  0.021539
b  0.904192  0.173583
c  0.353487  0.281895

#  Indexers: loc and iloc

> this is very important

> Implicit indexing - Default index

> explicit indexing - user defined index

In [58]:
data = pd.Series(['a','b','c'] , index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [59]:
data[1] # when you are using indexing python uses explicit index values

'a'

In [60]:
data[1:3] # when you are using slicing python uses implicit index values

3    b
5    c
dtype: object

In [61]:
data.loc[1]

'a'

In [50]:
data.loc[2]

AttributeError: 'dict' object has no attribute 'loc'

In [48]:
data.loc[3]

AttributeError: 'dict' object has no attribute 'loc'

In [46]:
data

{'Name': ['Tom', 'Jack', 'Steve', 'Mike'], 'Age': [28, 34, 24, 12]}

In [64]:
data.iloc[2] #implicit

'c'

In [65]:
data.loc[1:3] # explicit

1    a
3    b
dtype: object

In [66]:
data.iloc[1:3]

3    b
5    c
dtype: object

# Data Retrieval:

> List of Dictionaries

> csv files

> Databases

In [67]:
d = [ {'city':'Delhi','data':1000}, {'city':'Mumbai','data':2000}, 
     {'city':'Bangalore','data':1500} ]
pd.DataFrame(d)

        city  data
0      Delhi  1000
1     Mumbai  2000
2  Bangalore  1500

In [70]:
# online

df = pd.read_csv("https://raw.githubusercontent.com/ArunRavi93/Python/main/student_records.csv")
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [54]:
df = pd.read_csv ('C:/Users/Arun R/Desktop/Board_Infinity/Python\Raw_File_main/student_records.csv')
df

FileNotFoundError: [Errno 2] No such file or directory: 'C:/Users/Arun R/Desktop/Board_Infinity/Python\\Raw_File_main/student_records.csv'

In [55]:
df.head()

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [73]:
df.head(3)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
2  David            F        N             10            17        No

In [74]:
df.tail()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [75]:
df.tail(2)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [76]:
np.ndim(df)

2

In [77]:
df.shape

(8, 6)

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           8 non-null      object
 1   OverallGrade   8 non-null      object
 2   Obedient       8 non-null      object
 3   ResearchScore  8 non-null      int64
 4   ProjectScore   8 non-null      int64
 5   Recommend      8 non-null      object
dtypes: int64(2), object(4)
memory usage: 512.0+ bytes

In [79]:
df.describe()

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [80]:
print(df.quantile (.5))
print()
print(df.quantile (.35))
print()
print(df.quantile (.65))

ResearchScore    75.0
ProjectScore     55.0
Name: 0.5, dtype: float64

ResearchScore    66.75
ProjectScore     41.10
Name: 0.35, dtype: float64

ResearchScore    80.5
ProjectScore     65.6
Name: 0.65, dtype: float64

In [81]:
df.head()

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [83]:
df.Recommend

0    Yes
1    Yes
2     No
3     No
4     No
5    Yes
6     No
7     No
Name: Recommend, dtype: object

In [84]:
df['Recommend']

0    Yes
1    Yes
2     No
3     No
4     No
5    Yes
6     No
7     No
Name: Recommend, dtype: object

In [85]:
type(df)

pandas.core.frame.DataFrame

In [86]:
type(df['Recommend'])

pandas.core.series.Series

In [87]:
df[['OverallGrade','Recommend']]

  OverallGrade Recommend
0            A       Yes
1            C       Yes
2            F        No
3            B        No
4            E        No
5            A       Yes
6            B        No
7            C        No

In [92]:
df.columns

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [90]:
df.describe(include = 'all')

         Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
count       8            8        8       8.000000      8.000000         8
unique      8            5        2            NaN           NaN         2
top     Henry            A        Y            NaN           NaN        No
freq        1            2        5            NaN           NaN         5
mean      NaN          NaN      NaN      63.375000     53.125000       NaN
std       NaN          NaN      NaN      31.640559     24.752705       NaN
min       NaN          NaN      NaN      10.000000     17.000000       NaN
25%       NaN          NaN      NaN      50.000000     32.250000       NaN
50%       NaN          NaN      NaN      75.000000     55.000000       NaN
75%       NaN          NaN      NaN      86.250000     73.000000       NaN
max       NaN          NaN      NaN      92.000000     85.000000       NaN

In [53]:
list(df.columns)

['Population']

In [51]:
df.info

<bound method DataFrame.info of             Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135>

In [94]:
df.columns = ['Student_Name',
 'OverallGrade',
 'Obedient',
 'ResearchScore',
 'ProjectScore',
 'Recommend']

In [95]:
df.head()

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No

In [96]:
# df.rename({"Name":"Student_name"}, axis = 1)

In [98]:
df['ResearchScore'].mean()

63.375

In [100]:
x = df.drop('Student_Name',axis =1)
x

  OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0            A        Y             90            85       Yes
1            C        N             85            51       Yes
2            F        N             10            17        No
3            B        Y             75            71        No
4            E        N             20            30        No
5            A        Y             92            79       Yes
6            B        Y             60            59        No
7            C        Y             75            33        No

In [101]:
x1 = df.drop(0) # default axis is set to 0
x1

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [102]:
ff = df.drop(['Student_Name','Recommend'], axis = 1)
ff

  OverallGrade Obedient  ResearchScore  ProjectScore
0            A        Y             90            85
1            C        N             85            51
2            F        N             10            17
3            B        Y             75            71
4            E        N             20            30
5            A        Y             92            79
6            B        Y             60            59
7            C        Y             75            33

In [103]:
df.columns #gives all the columns

Index(['Student_Name', 'OverallGrade', 'Obedient', 'ResearchScore',
       'ProjectScore', 'Recommend'],
      dtype='object')

In [104]:
df.describe().columns  #gives only numerical columns

Index(['ResearchScore', 'ProjectScore'], dtype='object')

In [107]:
list(set(df.columns)- set(df.describe().columns))

['Recommend', 'Student_Name', 'OverallGrade', 'Obedient']

In [108]:
num_cols = df.select_dtypes(include=['int','float'])
num_cols

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [110]:
cat_cols = df.select_dtypes(exclude=['int','float']).columns
cat_cols

Index(['Student_Name', 'OverallGrade', 'Obedient', 'Recommend'], dtype='object')

In [111]:
df.head()

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No

In [1]:
df.iloc[:,:] # all data
df.iloc[0,0] # Henry
df.iloc[4,3] # # 4th row and 3rd column
df.iloc[:5,:] #  rows from 0 to 4 and all columns
df.iloc[:5,:2] # rows from 0 to 4 and columns from 0 to 1

NameError: name 'df' is not defined

In [113]:
df['ResearchScore']>=80

0     True
1     True
2    False
3    False
4    False
5     True
6    False
7    False
Name: ResearchScore, dtype: bool

In [117]:
# Find the students who have got the research score >=80 and project score >= 80

df[(df['ResearchScore']>=80) & (df['ProjectScore']>=80)]

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes

In [119]:
gg = df[(df['ResearchScore']>=60) & (df['ProjectScore']>=70)]
gg

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
3       Holmes            B        Y             75            71        No
5        Simon            A        Y             92            79       Yes

In [123]:
gg[gg['Student_Name'].str.startswith('H')]

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
3       Holmes            B        Y             75            71        No

In [128]:
x = df[df['ResearchScore']>=80]['Student_Name']
list(x)

['Henry', 'John', 'Simon']

In [130]:
df['OverallGrade'].unique()

array(['A', 'C', 'F', 'B', 'E'], dtype=object)

In [131]:
df['Obedient'].unique()

array(['Y', 'N'], dtype=object)

In [132]:
df['OverallGrade'].value_counts()

A    2
C    2
B    2
F    1
E    1
Name: OverallGrade, dtype: int64

In [133]:
df['Recommend'].value_counts()

No     5
Yes    3
Name: Recommend, dtype: int64

In [134]:
df['Recommend'].value_counts(normalize = True)

No     0.625
Yes    0.375
Name: Recommend, dtype: float64

In [135]:
df['ResearchScore'].sum()

507

In [136]:
df.count(axis= 0)

Student_Name     8
OverallGrade     8
Obedient         8
ResearchScore    8
ProjectScore     8
Recommend        8
dtype: int64

In [137]:
x = df

In [138]:
x

  Student_Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0        Henry            A        Y             90            85       Yes
1         John            C        N             85            51       Yes
2        David            F        N             10            17        No
3       Holmes            B        Y             75            71        No
4       Marvin            E        N             20            30        No
5        Simon            A        Y             92            79       Yes
6       Robert            B        Y             60            59        No
7        Trent            C        Y             75            33        No

In [139]:
x['Total'] = x['ResearchScore']+x['ProjectScore']

In [140]:
x

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total
0,Henry,A,Y,90,85,Yes,175
1,John,C,N,85,51,Yes,136
2,David,F,N,10,17,No,27
3,Holmes,B,Y,75,71,No,146
4,Marvin,E,N,20,30,No,50
5,Simon,A,Y,92,79,Yes,171
6,Robert,B,Y,60,59,No,119
7,Trent,C,Y,75,33,No,108

In [141]:
x['PercentageScore'] = (x.Total/200)*100

In [142]:
x

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore
0,Henry,A,Y,90,85,Yes,175,87.5
1,John,C,N,85,51,Yes,136,68.0
2,David,F,N,10,17,No,27,13.5
3,Holmes,B,Y,75,71,No,146,73.0
4,Marvin,E,N,20,30,No,50,25.0
5,Simon,A,Y,92,79,Yes,171,85.5
6,Robert,B,Y,60,59,No,119,59.5
7,Trent,C,Y,75,33,No,108,54.0

In [143]:
x.PercentageScore = np.round(x.PercentageScore,0)

In [144]:
x

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore
0,Henry,A,Y,90,85,Yes,175,88.0
1,John,C,N,85,51,Yes,136,68.0
2,David,F,N,10,17,No,27,14.0
3,Holmes,B,Y,75,71,No,146,73.0
4,Marvin,E,N,20,30,No,50,25.0
5,Simon,A,Y,92,79,Yes,171,86.0
6,Robert,B,Y,60,59,No,119,60.0
7,Trent,C,Y,75,33,No,108,54.0

In [145]:
x.PercentageScore = x.PercentageScore.astype('int')
x

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore
0,Henry,A,Y,90,85,Yes,175,88
1,John,C,N,85,51,Yes,136,68
2,David,F,N,10,17,No,27,14
3,Holmes,B,Y,75,71,No,146,73
4,Marvin,E,N,20,30,No,50,25
5,Simon,A,Y,92,79,Yes,171,86
6,Robert,B,Y,60,59,No,119,60
7,Trent,C,Y,75,33,No,108,54

In [146]:
x['Randome'] = 9999

In [147]:
x

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore,Randome
0,Henry,A,Y,90,85,Yes,175,88,9999
1,John,C,N,85,51,Yes,136,68,9999
2,David,F,N,10,17,No,27,14,9999
3,Holmes,B,Y,75,71,No,146,73,9999
4,Marvin,E,N,20,30,No,50,25,9999
5,Simon,A,Y,92,79,Yes,171,86,9999
6,Robert,B,Y,60,59,No,119,60,9999
7,Trent,C,Y,75,33,No,108,54,9999

In [149]:
df_staffingData = pd.read_excel("C:/Users/Arun R/Desktop/Board_Infinity\Python\Raw_File_main/Staffing Data.xlsx",sheet_name = "DemandData")

In [150]:
df_staffingData.head()

  State Month  Demand
0     A   Jan    5240
1     A   Feb    4878
2     A   Mar    5942
3     A   Apr    2297
4     A   May    1992

In [152]:
df_cost = pd.read_excel("C:/Users/Arun R/Desktop/Board_Infinity\Python\Raw_File_main/Staffing Data.xlsx",sheet_name = "Cost")

In [154]:
df_cost.head()

  State Month  AnnualSalary  MonthlySalary  UnitOutSourceCost
0     A   Jan         60000         5000.0                180
1     A   Feb         60000         5000.0                180
2     A   Mar         60000         5000.0                180
3     A   Apr         60000         5000.0                180
4     A   May         60000         5000.0                180

In [155]:
df

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore,Randome
0,Henry,A,Y,90,85,Yes,175,88,9999
1,John,C,N,85,51,Yes,136,68,9999
2,David,F,N,10,17,No,27,14,9999
3,Holmes,B,Y,75,71,No,146,73,9999
4,Marvin,E,N,20,30,No,50,25,9999
5,Simon,A,Y,92,79,Yes,171,86,9999
6,Robert,B,Y,60,59,No,119,60,9999
7,Trent,C,Y,75,33,No,108,54,9999

In [160]:
from numpy import nan
df.iloc[1,1]=nan
df.iloc[1,2]=nan
df.iloc[1,5]=nan
df.iloc[1,3]=nan
df

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore,Randome
0,Henry,A,Y,90.0,85,Yes,175,88,9999
1,John,NaN,NaN,NaN,51,NaN,136,68,9999
2,David,F,N,10.0,17,No,27,14,9999
3,Holmes,B,Y,75.0,71,No,146,73,9999
4,Marvin,E,N,20.0,30,No,50,25,9999
5,Simon,A,Y,92.0,79,Yes,171,86,9999
6,Robert,B,Y,60.0,59,No,119,60,9999
7,Trent,C,Y,75.0,33,No,108,54,9999

In [159]:
df.ResearchScore.fillna(0,axis = 0, inplace = True)
df

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore,Randome
0,Henry,A,Y,90.0,85,Yes,175,88,9999
1,John,NaN,NaN,0.0,51,NaN,136,68,9999
2,David,F,N,10.0,17,No,27,14,9999
3,Holmes,B,Y,75.0,71,No,146,73,9999
4,Marvin,E,N,20.0,30,No,50,25,9999
5,Simon,A,Y,92.0,79,Yes,171,86,9999
6,Robert,B,Y,60.0,59,No,119,60,9999
7,Trent,C,Y,75.0,33,No,108,54,9999

In [161]:
df

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore,Randome
0,Henry,A,Y,90.0,85,Yes,175,88,9999
1,John,NaN,NaN,NaN,51,NaN,136,68,9999
2,David,F,N,10.0,17,No,27,14,9999
3,Holmes,B,Y,75.0,71,No,146,73,9999
4,Marvin,E,N,20.0,30,No,50,25,9999
5,Simon,A,Y,92.0,79,Yes,171,86,9999
6,Robert,B,Y,60.0,59,No,119,60,9999
7,Trent,C,Y,75.0,33,No,108,54,9999

In [162]:
df.ResearchScore.mean()

60.285714285714285

In [163]:
df.ResearchScore.fillna(df.ResearchScore.mean(),axis = 0, inplace = True)
df

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore,Randome
0,Henry,A,Y,90.000000,85,Yes,175,88,9999
1,John,NaN,NaN,60.285714,51,NaN,136,68,9999
2,David,F,N,10.000000,17,No,27,14,9999
3,Holmes,B,Y,75.000000,71,No,146,73,9999
4,Marvin,E,N,20.000000,30,No,50,25,9999
5,Simon,A,Y,92.000000,79,Yes,171,86,9999
6,Robert,B,Y,60.000000,59,No,119,60,9999
7,Trent,C,Y,75.000000,33,No,108,54,9999

In [168]:
df.Recommend.mode()
# df.Recommend.mode()[0]

'No'

In [169]:
df.Recommend.fillna(df.Recommend.mode()[0],axis = 0, inplace = True)
df

,Student_Name,OverallGrade,Obedient,ResearchScore,ProjectScore,Recommend,Total,PercentageScore,Randome
0,Henry,A,Y,90.000000,85,Yes,175,88,9999
1,John,NaN,NaN,60.285714,51,No,136,68,9999
2,David,F,N,10.000000,17,No,27,14,9999
3,Holmes,B,Y,75.000000,71,No,146,73,9999
4,Marvin,E,N,20.000000,30,No,50,25,9999
5,Simon,A,Y,92.000000,79,Yes,171,86,9999
6,Robert,B,Y,60.000000,59,No,119,60,9999
7,Trent,C,Y,75.000000,33,No,108,54,9999

In [170]:
# Forward fill 

# reverse Fill 

# Group split combine

In [172]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2
Note: you may need to restart the kernel to use updated packages.

In [173]:
# impot from MYsql database

import pymysql
import pandas as pd

conn = pymysql.connect(host='127.0.0.1',port=int(3306),user='root',passwd= 'Root@123',db = 'sakila')
df = pd.read_sql_query("Select * from actor",conn)

C:\Users\Arun R\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [174]:
df.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [ ]:
#how to write on Excel

In [2]:
import pandas as pd
import openpyxl
df=pd.DataFrame([[10,20,30],[11,22,33],[12,23,34]],index=['one','two','three'],columns=['a','b','c'])
df

        a   b   c
one    10  20  30
two    11  22  33
three  12  23  34

In [3]:
df.to_excel('pandas_to_excel_test_march_4.xlsx',sheet_name='My_first_sheet')

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/ArunRavi93/Python/main/student_records.csv")
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [7]:
dff=pd.DataFrame({
                'key':['A','B','C','A','B','C'],
                'DATA':range(1,7)   
})
dff

  key  DATA
0   A     1
1   B     2
2   C     3
3   A     4
4   B     5
5   C     6

In [9]:
dff.key.unique()

array(['A', 'B', 'C'], dtype=object)

In [12]:
list(dff.groupby('key'))

[('A',
    key  DATA
  0   A     1
  3   A     4),
 ('B',
    key  DATA
  1   B     2
  4   B     5),
 ('C',
    key  DATA
  2   C     3
  5   C     6)]

In [13]:
dff.groupby('key').sum()

     DATA
key
A       5
B       7
C       9

In [14]:
dff.groupby('key').mean()

     DATA
key
A     2.5
B     3.5
C     4.5

In [18]:
dff.groupby('key').describe()

     DATA
    count mean      std  min   25%  50%   75%  max
key
A     2.0  2.5  2.12132  1.0  1.75  2.5  3.25  4.0
B     2.0  3.5  2.12132  2.0  2.75  3.5  4.25  5.0
C     2.0  4.5  2.12132  3.0  3.75  4.5  5.25  6.0

In [19]:
dff.groupby('key').max()

     DATA
key
A       4
B       5
C       6

In [20]:
dff.groupby('key').min()

     DATA
key
A       1
B       2
C       3

In [21]:
dff.groupby('key').count()

     DATA
key
A       2
B       2
C       2

In [22]:
dff.groupby('key').std()

        DATA
key
A    2.12132
B    2.12132
C    2.12132

In [24]:
dff.groupby('key').quantile()

     DATA
key
A     2.5
B     3.5
C     4.5

In [27]:
dff.groupby('key').aggregate(['min','max','std','count','var'])

    DATA
     min max      std count  var
key
A      1   4  2.12132     2  4.5
B      2   5  2.12132     2  4.5
C      3   6  2.12132     2  4.5

In [37]:
df = pd.read_csv("https://raw.githubusercontent.com/ArunRavi93/Python/main/student_records.csv")
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [52]:
from numpy import nan
df.iloc[2,2]=nan
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F      NaN             10            17        No
3  Holmes            B      NaN             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [53]:
df.Obedient.fillna('Y',inplace=True)
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        Y             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [54]:
df.Obedient.fillna(method='bfill',inplace=True)
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        Y             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [55]:
df.Obedient.fillna(method='ffill',inplace=True)
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        Y             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No